trade_exp/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоступлениеОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрироватьЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиДляПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КроссДокинг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30a590e2-6596-4de0-a4be-cfbb5399d172">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f8ead0eb-21aa-4e1f-8164-ee742c343e92">
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cdedb2c-9438-46bb-96fb-6a845d8582f4">
    <name>СуммаВозвратнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d98fbb64-76a2-40b3-b574-49c707b7bcb3">
    <name>ДатаПервогоПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="acabeecd-5076-4d22-9652-a2ee1ee153df">
    <name>СуммаПредоплатыДоПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2d778d9-a008-4546-b5fa-9b25ddc9609f">
    <name>СуммаАвансаДоПодтверждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e13b4eca-d382-4210-b95b-b08bc5825d14">
    <name>ДокументыОтСкладаПолучены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31d4229d-7e07-4e4a-9f92-1976c47d4f63">
    <name>ВесПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dece339b-2105-4c98-a2e4-1f5dcc38566a">
    <name>ОбъемПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="165cb2b7-35c2-43ff-87ab-494ece2907a0">
    <name>Норматив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="92683317-6424-449c-bc95-666f2f041e6c">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1909ef6d-dda2-4d5f-9cf1-9de8ee7d90e4">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="986908c6-9d6d-4369-9adc-da7c74e6cc10">
    <name>ОтключитьКонтрольЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b9a0f800-6f65-4509-aec7-1670f5b445be">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b9741a38-d099-44b3-80ee-269109b8ccbf">
    <name>ДлительностьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="22123465-b48b-4cb0-9380-1ebabf57bf68">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fc2995a3-f83e-4468-8f9a-ab580932140a">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5485e49-b94a-46f3-aa70-100271167e47">
    <name>НомерПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СписатьНаРасходы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fb7178d5-075f-4bff-bd5e-69dd3c98eeb0">
      <name>НоменклатураПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="936553b0-c400-4185-a80f-e05eba62422e">
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>ТоварыИсходная</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="062883fc-ecd3-4fff-bee1-24c39065e066">
    <name>ПисьмаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="00b8aece-fe81-4c6a-957f-030bed24e14c">
      <name>ПисьмоПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ЗаказПоставщику/Forms/Док_ЗагрузитьСчетОтПоставщика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Поставщик = Параметры.Поставщик;
	Ссылка = Параметры.Ссылка;
	Товары.Загрузить(Параметры.Товар.Выгрузить());
	
	Инициализация();
	
КонецПроцедуры

&НаСервере
Процедура Инициализация()
	
	ТабличныйДокумент.Очистить();
	
	Макет = Документы.ЗаказПоставщику.ПолучитьМакет("Док_ЗагрузитьСчетОтПоставщика");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.ФиксацияСверху = 1;
	ТабличныйДокумент.ТолькоПросмотр = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Истина;
	
	Элементы.СтраницаПроверитьСчет.Видимость = Истина;
	Элементы.СтраницаНоваяНоменклатура.Видимость = Ложь;
	Элементы.СтраницаСозданиеНоменклатурыПоставщика.Видимость = Ложь;
	Элементы.СтраницаСверкаСчета.Видимость = Ложь;     
	
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьСчет(Команда)
	
	ПроверитьСчетНаСервере();
	
	Если СозданиеНоменклатурыПоставщика.Количество() > 0 Тогда 
		Элементы.СтраницаПроверитьСчет.Видимость = Ложь;
		Элементы.СтраницаНоваяНоменклатура.Видимость = Истина;
	Иначе
		Элементы.СтраницаПроверитьСчет.Видимость = Ложь;
		Элементы.СтраницаСверкаСчета.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры 

//Главный цикл
&НаСервере
Процедура ПроверитьСчетНаСервере()
	
	СверкаСчета.Очистить();
	СозданиеНоменклатурыПоставщика.Очистить();
	
	НомерСтроки = 2;
	
	Пока Истина Цикл
		стрНомерСтроки = XMLСтрока(НомерСтроки);
		
		Артикул = СокрЛП(ТабличныйДокумент.Область("R" + Строка(стрНомерСтроки) + "C1").Текст);
		НаименованиеПоставщика = СокрЛП(ТабличныйДокумент.Область("R" + Строка(стрНомерСтроки) + "C2").Текст);
		СчетКоличество = СокрЛП(ТабличныйДокумент.Область("R" + Строка(стрНомерСтроки) + "C3").Текст);
		СчетЦена = СокрЛП(ТабличныйДокумент.Область("R" + Строка(стрНомерСтроки) + "C4").Текст);
		СчетСумма = СокрЛП(ТабличныйДокумент.Область("R" + Строка(стрНомерСтроки) + "C5").Текст);
		ЕдИзм = СокрЛП(ТабличныйДокумент.Область("R" + Строка(стрНомерСтроки) + "C6").Текст);
		
		Если ПустаяСтрока(НаименованиеПоставщика) Тогда 
			Прервать;
		КонецЕсли;
		
		Попытка
			СчетКоличество = Число(СчетКоличество);
		Исключение
			СчетКоличество = 0;
			Сообщить("Не удалось определить количество по строке: "+НомерСтроки);
		КонецПопытки;
		
		Если ПустаяСтрока(СчетЦена) Тогда
			СчетЦена= 0;
		Иначе
			Попытка
				СчетЦена= Число(СчетЦена);
			Исключение
				СчетЦена = 0;
				Сообщить("Не удалось определить цену по строке: "+НомерСтроки);
			КонецПопытки;
		КонецЕсли;
		
		Если ПустаяСтрока(СчетСумма) Тогда
			СчетСумма = 0;
		Иначе
			Попытка
				СчетСумма = Число(СчетСумма);
			Исключение
				СчетСумма = 0;
				Сообщить("Не удалось определить сумму по строке: "+НомерСтроки);
			КонецПопытки;
		КонецЕсли;
		
		ЕдиницаПоставщика = Неопределено;
		
		НоменклатураПоставщика = Неопределено;
		
		Если Не ПустаяСтрока(НаименованиеПоставщика) Тогда
			
			НоменклатураПоставщика = НайтиДействительнуюНоменклатуруПоставщика(Поставщик, Артикул, НаименованиеПоставщика);
			
			Если Не ЗначениеЗаполнено(НоменклатураПоставщика) Тогда
				НоваяСтрока = СозданиеНоменклатурыПоставщика.Добавить();
				НоваяСтрока.Артикул = Артикул;
				НоваяСтрока.НаименованиеПоставщика = НаименованиеПоставщика;
				Если Не ПустаяСтрока(ЕдИзм) Тогда
					НоваяСтрока.ЕдиницаПоставщика = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(ЕдИзм);
				КонецЕсли;
			Иначе
				НоваяСтрока = СверкаСчета.Добавить();
				НоваяСтрока.НоменклатураПоставщика = НоменклатураПоставщика;
				НоваяСтрока.Номенклатура = НоменклатураПоставщика.Номенклатура;
				Если Не ЗначениеЗаполнено(НоменклатураПоставщика.ЕдиницаПоставщика) Тогда
					Если Не ПустаяСтрока(ЕдИзм) Тогда
						НоваяСтрока.ЕдиницаПоставщика = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(ЕдИзм);
					Иначе
						НоваяСтрока.ЕдиницаПоставщика = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
					КонецЕсли;
				Иначе
					НоваяСтрока.ЕдиницаПоставщика = НоменклатураПоставщика.ЕдиницаПоставщика;
				КонецЕсли;
				
				//Расчет Количества по ед. зм
				РасчетноеКоличество = 0;
				Если НоваяСтрока.Номенклатура.ЕдиницаИзмерения = НоваяСтрока.ЕдиницаПоставщика Тогда
					НоваяСтрока.СчетКоличество = СчетКоличество;
				Иначе
					//Объем
					Если НоваяСтрока.ЕдиницаПоставщика = Константы.ЕдиницаИзмеренияОбъема.Получить() И НоваяСтрока.Номенклатура.ОбъемИспользовать Тогда
						РасчетноеКоличество = НоваяСтрока.Номенклатура.ОбъемЗнаменатель * СчетКоличество / НоваяСтрока.Номенклатура.ОбъемЧислитель;
					КонецЕсли;
					//Вес
					Если НоваяСтрока.ЕдиницаПоставщика = Константы.ЕдиницаИзмеренияВеса.Получить() И НоваяСтрока.Номенклатура.ВесИспользовать Тогда
						РасчетноеКоличество = НоваяСтрока.Номенклатура.ВесЗнаменатель * СчетКоличество / НоваяСтрока.Номенклатура.ВесЧислитель;
					КонецЕсли;
					//Площадь
					Если НоваяСтрока.ЕдиницаПоставщика = Константы.ЕдиницаИзмеренияПлощади.Получить() И НоваяСтрока.Номенклатура.ПлощадьИспользовать Тогда
						РасчетноеКоличество = НоваяСтрока.Номенклатура.ПлощадьЗнаменатель*СчетКоличество/НоваяСтрока.Номенклатура.ПлощадьЧислитель;
					КонецЕсли;
					//Длинна
					Если НоваяСтрока.ЕдиницаПоставщика = Константы.ЕдиницаИзмеренияДлины.Получить() И НоваяСтрока.Номенклатура.ДлинаИспользовать Тогда
						РасчетноеКоличество = НоваяСтрока.Номенклатура.ДлинаЗнаменатель * СчетКоличество / НоваяСтрока.Номенклатура.ДлинаЧислитель;
					КонецЕсли;
					//Либо расчетное либо равно СчетКоличество
					НоваяСтрока.СчетКоличество = ?(РасчетноеКоличество = 0, СчетКоличество, РасчетноеКоличество);
				КонецЕсли;		
										
					//СчетСумма
					//СчетКоличество - исходное количество
					 //НоваяСтрока.СчетКоличество - уже пересчитанное количество
					Если НоваяСтрока.СчетКоличество > 0 Тогда
						Если СчетСумма = 0 Тогда
							НоваяСтрока.СчетЦена = СчетЦена * СчетКоличество / НоваяСтрока.СчетКоличество;
							НоваяСтрока.СчетСумма = НоваяСтрока.СчетКоличество * НоваяСтрока.СчетЦена;
						Иначе
							НоваяСтрока.СчетСумма = СчетСумма * СчетКоличество / НоваяСтрока.СчетКоличество;
							НоваяСтрока.СчетЦена = НоваяСтрока.СчетСумма / СчетКоличество;
						КонецЕсли;
					Иначе
						НоваяСтрока.СчетСумма = 0;
						НоваяСтрока.СчетЦена = 0;
					КонецЕсли;
					
				КонецЕсли;
		Иначе
			Сообщить("Пустое наименование поставщика в строке: "+НомерСтроки);
		КонецЕсли;
		
		НомерСтроки = НомерСтроки+1;
	КонецЦикла;
	
	ПолучитьСверкуСчета();
	
КонецПроцедуры

&НаСервере
Функция НайтиДействительнуюНоменклатуруПоставщика(Поставщик, Артикул, НаименованиеПоставщика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НоменклатураКонтрагентов.Владелец = &Владелец
		|	И НоменклатураКонтрагентов.Недействителен = ЛОЖЬ
		|	И (&Артикул
		|			ИЛИ НоменклатураКонтрагентов.Наименование = &Наименование
		|			ИЛИ НоменклатураКонтрагентов.НаименованиеПолное = &НаименованиеПолное)
		|	И НоменклатураКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И НоменклатураКонтрагентов.Номенклатура.ПометкаУдаления = ЛОЖЬ";
	
	Если ЗначениеЗаполнено(Артикул) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Артикул", "НоменклатураКонтрагентов.Артикул = &Артикул");
		Запрос.УстановитьПараметр("Артикул", Артикул);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Артикул", "ЛОЖЬ");
	КонецЕсли;
	Запрос.УстановитьПараметр("Владелец", Поставщик);
	Запрос.УстановитьПараметр("Наименование", НаименованиеПоставщика);
	Запрос.УстановитьПараметр("НаименованиеПолное", НаименованиеПоставщика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//Запрос
&НаСервере
Процедура ПолучитьСверкуСчета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
"ВЫБРАТЬ
	|	ТоварИзСчета.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	ТоварИзСчета.СчетКоличество КАК СчетКоличество,
	|	ТоварИзСчета.СчетЦена КАК СчетЦена,
	|	ТоварИзСчета.СчетСумма КАК СчетСумма,
	|	ТоварИзСчета.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ТоварСчета
	|ИЗ
	|	&ТоварИзСчета КАК ТоварИзСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварИзЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварИзЗаказа.Количество КАК Количество,
	|	ТоварИзЗаказа.Цена КАК Цена,
	|	ТоварИзЗаказа.Сумма КАК Сумма,
	|	ТоварИзЗаказа.Отменено КАК Отменено
	|ПОМЕСТИТЬ ВТ_ТоварИзЗаказа
	|ИЗ
	|	&ТоварИзЗаказа КАК ТоварИзЗаказа
	|ГДЕ
	|	ТоварИзЗаказа.Отменено = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ТоварИзЗаказа.Номенклатура, ВТ_ТоварСчета.Номенклатура) КАК Номенклатура,
	|	ВТ_ТоварИзЗаказа.Количество КАК ЗаказКоличество,
	|	ВТ_ТоварИзЗаказа.Цена КАК ЗаказЦена,
	|	ВТ_ТоварСчета.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	ВТ_ТоварСчета.СчетКоличество КАК СчетКоличество,
	|	ВТ_ТоварСчета.СчетЦена КАК СчетЦена,
	|	ВТ_ТоварИзЗаказа.Количество - ВТ_ТоварСчета.СчетКоличество КАК РазницаКоличество,
	|	ВТ_ТоварИзЗаказа.Цена - ВТ_ТоварСчета.СчетЦена КАК РазницаЦена,
	|	ВТ_ТоварИзЗаказа.Сумма КАК ЗаказСумма,
	|	ВТ_ТоварСчета.СчетСумма КАК СчетСумма,
	|	ЕСТЬNULL(ВТ_ТоварИзЗаказа.Номенклатура, ИСТИНА) КАК НетВЗаказе,
	|	ЕСТЬNULL(ВТ_ТоварСчета.Номенклатура, ИСТИНА) КАК НетВСчете
	|ИЗ
	|	ВТ_ТоварИзЗаказа КАК ВТ_ТоварИзЗаказа
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТоварСчета КАК ВТ_ТоварСчета
	|		ПО ВТ_ТоварИзЗаказа.Номенклатура = ВТ_ТоварСчета.Номенклатура"; 
	
	Запрос.УстановитьПараметр("ТоварИзСчета", СверкаСчета.Выгрузить());
	Запрос.УстановитьПараметр("ТоварИзЗаказа", Товары.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	СверкаСчета.Загрузить(РезультатЗапроса.Выгрузить()); 
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяНоменклатура_да(Команда)
	Элементы.СтраницаНоваяНоменклатура.Видимость = Ложь;
	Элементы.СтраницаСозданиеНоменклатурыПоставщика.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НоваяНоменклатура_Назад(Команда)
	Элементы.СтраницаПроверитьСчет.Видимость = Истина;
	Элементы.СтраницаНоваяНоменклатура.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НоваяНоменклатура_Пропустить(Команда)
	Элементы.СтраницаНоваяНоменклатура.Видимость = Ложь;
	Элементы.СтраницаСверкаСчета.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНоменклатурыПоставщика_Создать(Команда)
	СозданиеНоменклатурыПоставщика_СоздатьНаСервере();
КонецПроцедуры 

&НаСервере
Процедура СозданиеНоменклатурыПоставщика_СоздатьНаСервере()
	
	Для Каждого стрНовая Из СозданиеНоменклатурыПоставщика Цикл
		Если Не ЗначениеЗаполнено(стрНовая.НоменклатураПоставщика) И ЗначениеЗаполнено(стрНовая.Номенклатура) Тогда
			Если Не ПустаяСтрока(стрНовая.НаименованиеПоставщика) Тогда
				НоменклатураПоставщикаОбъект = Справочники.НоменклатураКонтрагентов.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НоменклатураПоставщикаОбъект, стрНовая);
				НоменклатураПоставщикаОбъект.Наименование = стрНовая.НаименованиеПоставщика;
				НоменклатураПоставщикаОбъект.НаименованиеНоменклатуры = стрНовая.НаименованиеПоставщика;
				НоменклатураПоставщикаОбъект.Владелец = Поставщик;
				НоменклатураПоставщикаОбъект.УстановитьНовыйКод();
				
				Попытка
					НоменклатураПоставщикаОбъект.Записать();
					стрНовая.НоменклатураПоставщика= НоменклатураПоставщикаОбъект.Ссылка;
				Исключение         
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ОписаниеОшибки(),
						?(НоменклатураПоставщикаОбъект.ДополнительныеСвойства.Свойство("ОбнаруженоДублированиеКлючевыхЗначений"), НоменклатураПоставщикаОбъект.ДополнительныеСвойства.ОбнаруженоДублированиеКлючевыхЗначений, Неопределено));
				КонецПопытки;
			Иначе
				Сообщить("Выявлено пустое наименование поставщика для номенклатуры: "+стрНовая.Номенклатура);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры  

&НаКлиенте
Процедура СозданиеНоменклатурыПоставщикаНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СозданиеНоменклатурыПоставщика.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаПоставщика) Тогда
		ТекущаяСтрока.ЕдиницаПоставщика = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура, "ЕдиницаИзмерения");
	КонецЕсли;  
		 
КонецПроцедуры

&НаКлиенте
Процедура СверкаСчета_Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СверкаСчета_Назад(Команда)
	Элементы.СтраницаПроверитьСчет.Видимость = Истина;
	Элементы.СтраницаСверкаСчета.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СверкаСчета_ВнестиИзмененияПоСчету(Команда)
	Закрыть(СверкаСчета);
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНоменклатурыПоставщика_Назад(Команда)
	Элементы.СтраницаПроверитьСчет.Видимость = Истина;
	Элементы.СтраницаСозданиеНоменклатурыПоставщика.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСравнения(Команда) 
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Док_СравнениеСоСчетом");
	ТабДок = СформироватьПечатьСравненияНаСервере(КоллекцияПечатныхФорм);
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
КонецПроцедуры 

&НаСервере
Функция СформироватьПечатьСравненияНаСервере(КоллекцияПечатныхФорм)
	
	Макет = Документы.ЗаказПоставщику.ПолучитьМакет("Док_СравнениеСоСчетом");
	ТабДок = Новый ТабличныйДокумент;
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Шапка.Параметры.Ссылка = Ссылка;
	ТабДок.Вывести(Шапка);
	
	Для Каждого стрСверки Из СверкаСчета Цикл
		Строка.Параметры.Артикул = стрСверки.НоменклатураПоставщика.Артикул;
		Строка.Параметры.НоменклатураПоставщика = стрСверки.НоменклатураПоставщика;
		Строка.Параметры.Код = стрСверки.Номенклатура.Код;
		Строка.Параметры.Номенклатура = стрСверки.Номенклатура;
		Строка.Параметры.ЗаказКоличество = стрСверки.ЗаказКоличество;
		Строка.Параметры.СчетКоличество = стрСверки.СчетКоличество;
		Строка.Параметры.РазницаКоличество = стрСверки.РазницаКоличество;
		Строка.Параметры.ЗаказЦена = стрСверки.ЗаказЦена;
		Строка.Параметры.СчетЦена = стрСверки.СчетЦена;
		Строка.Параметры.РазницаЦена = стрСверки.РазницаЦена;
		
		ТабДок.Вывести(Строка);
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ПолеСправа = 5;
	
	Возврат ТабДок; 
	
КонецФункции
